/*=========================================================================
==                           field.h                                     ==
==   Field -- игровое поле, содержащее в себе всё необходимое для игры.  ==
==   Описание:                                                           ==
==   Структура содержащее разные объекты, которые могут взаимодействовать==
== друг с другом через это поле. /                                       ==
==                                                                       ==
==   Field -- field, that should contain all gaming objects              ==
=========================================================================*/
/*Авторы/Authors: zlv(Евгений Лежнин) <z_lezhnin@mail2000.ru>, 2011 -- Томск->Сибирь
             pavertomato(Егор Лежнин) <pavertomato@gmail.com>, 2011 -- Томск->Сибирь*/
#include "field.h"
#include "ball.h"

Field::Field()
{
}

CircleOfDeath* Field::circle()
{
    return circle_;
}
